/* 编写程序输出一下主菜单，并在该菜单中输入选项 */
/* 
	|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|
	|      请输入选项编号（0-7）      |
	|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|
	|             1：输入             |
	|             2：显示             |
	|             3：查找             |
	|             4：最值             |
	|             5：插入             |
	|             6：删除             |
	|             7：排序             |
	|             0：退出             |
	|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|
*/
#include <stdio.h>
void main()
{
	char choose = '\0';
	printf("\t|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
	printf("\t|      请输入选项编号（0-7）      |\n");
	printf("\t|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
	printf("\t|             1：输入             |\n");
	printf("\t|             2：显示             |\n");
	printf("\t|             3：查找             |\n");
	printf("\t|             4：最值             |\n");
	printf("\t|             5：插入             |\n");
	printf("\t|             6：删除             |\n");
	printf("\t|             7：排序             |\n");
	printf("\t|             0：退出             |\n");
	printf("\t|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
	
	choose = getchar();
	
	if(choose >= 48 && choose <=55)
	{
		printf("您输入的是：%c? 请确认！",choose);
	}
	else
	{
		printf("请输入（0-7）的整数"); 
	}
}
